# Brewfile — declarative Homebrew packages
# Install everything: brew bundle
# Install and upgrade: brew bundle --upgrade
# Check what's missing: brew bundle check

# ------------------
# Shell & prompt
# ------------------
brew "starship"       # cross-shell prompt
brew "zoxide"         # smart cd with frecency ranking
brew "fzf"            # fuzzy finder (Ctrl+R history, Ctrl+T file picker)

# ------------------
# File & search
# ------------------
brew "bat"            # cat with syntax highlighting
brew "ripgrep"        # faster grep (rg)
brew "fd"             # faster find

# ------------------
# Git
# ------------------
brew "git-lfs"        # large file storage
brew "git-delta"      # syntax-highlighted diffs
brew "lazygit"        # terminal UI for git
brew "gh"             # GitHub CLI

# ------------------
# Ruby
# ------------------
brew "chruby"         # Ruby version switcher
brew "ruby-install"   # Ruby version installer
brew "openssl@3"      # required for building Ruby

# ------------------
# Node
# ------------------
brew "nvm"            # Node version manager

# ------------------
# Terminal multiplexer
# ------------------
brew "tmux"

# ------------------
# Data & utilities
# ------------------
brew "jq"             # JSON processor
brew "shellcheck"     # shell script linter
brew "tree"           # directory tree view

# ------------------
# Apps (casks)
# ------------------
cask "raycast"        # launcher, clipboard history, window management
