# VS Code extensions
# Install all: cat ~/dotfiles/vscode/extensions.txt | grep -v '^#' | grep -v '^$' | xargs -L1 code --install-extension
# Java extensions are in extensions-java.txt

# Git
eamodio.gitlens
mhutchie.git-graph
vivaxy.vscode-conventional-commits
github.vscode-pull-request-github

# Linting
dbaeumer.vscode-eslint
stylelint.vscode-stylelint

# IntelliSense
visualstudioexptteam.vscodeintellicode
visualstudioexptteam.intellicode-api-usage-examples

# AI assistants
continue.continue
github.copilot
github.copilot-chat

# Docker / containers
docker.docker
ms-vscode-remote.remote-containers

# Productivity
streetsidesoftware.code-spell-checker
usernamehw.errorlens

# Themes
github.github-vscode-theme
